In [2]:
import numpy as np
import pandas as pd

In [3]:
# Leemos archivo personal_buque.csv
personal_orig = pd.read_csv('personal_buque.csv')
#personal_orig.head(5)

In [4]:
# Leemos archivo buques.csv
buques_orig = pd.read_csv('buques.csv')

# Eliminamos el espacio del nombre de la columna nombre_naviera
buques_orig.rename(columns = {' nombre_naviera': 'nombre_naviera'}, inplace = True)

#buques_orig.head(5)

In [5]:
# Formamos la tabla Naviera
Naviera = buques_orig[['nombre_naviera','pais_naviera', 'descripcion_naviera']]

#Naviera.head(5)
#Naviera.dtypes
#Naviera.describe()

In [6]:
# Eliminamos filas duplicadas de naviera
Naviera = Naviera.drop_duplicates()
# Confirmamos que nombre_naviera es llave
#Naviera.describe()

In [7]:
Buque = buques_orig[['id_buque','nombre', 'patente', 'pais']]
# Cantidad de tuplas es 250
#len(Buque)

In [8]:
# Nombres de columnas
#buques_orig.dtypes

In [9]:
# Eliminamos filas duplicadas de buques
Buque = Buque.drop_duplicates()
# No había filas duplicadas
#len(Buque)

In [14]:
BuquePesquero = buques_orig[['id_buque','tipo', 'tipo_pesca']]
#BuquePesquero.head(10)

In [15]:
indexNames = BuquePesquero[ BuquePesquero['tipo'] != 'pesquero' ].index

In [16]:
BuquePesquero.drop(indexNames, inplace=True)
#BuquePesquero.head(10)
del BuquePesquero["tipo"]

In [17]:
# Hay 91 buques pesqueros
#len(BuquePesquero)
# Hay 6 tipos de pesca, moda hilo con frecuencia 20
#BuquePesquero.describe(include="all")

In [18]:
BuqueCarga = buques_orig[['id_buque','tipo', 'max_containers', 'max_ton']]
indexNames = BuqueCarga[ BuqueCarga['tipo'] != 'carga' ].index
BuqueCarga.drop(indexNames, inplace=True)
#BuqueCarga.head(10)
del BuqueCarga["tipo"]
BuqueCarga = BuqueCarga.astype({"max_containers": int, "max_ton": int})

In [19]:
# Hay 74 buques de carga
#len(BuqueCarga)
#BuqueCarga.describe(include="all")

In [20]:
BuquePetrolero = buques_orig[['id_buque','tipo', 'max_lit']]
indexNames = BuquePetrolero[ BuquePetrolero['tipo'] != 'petrolero' ].index
BuquePetrolero.drop(indexNames, inplace=True)
#BuquePetrolero.head(10)
del BuquePetrolero["tipo"]
BuquePetrolero = BuquePetrolero.astype({"max_lit": int})

In [21]:
Tiene = buques_orig[['id_buque','nombre_naviera']]

In [23]:
Trabajan = personal_orig[['id_personal', 'id_buque']]
# Hay 1643 relaciones trabajan
#len(Trabajan)
Trabajan = Trabajan.assign(cargo="trabajador")

for i in range(len(Buque)):
    id_personal = int(buques_orig.iloc[i]["id_capitan"])
    Trabajan["cargo"].iloc[id_personal] = "capitan"

# Imprime las últimas 5 tuplas
#Trabajan.iloc[1638:]

In [24]:
# Leemos archivo itinerarios.csv
itinerarios_orig = pd.read_csv('itinerarios.csv')

#itinerarios_orig.head(10)
#itinerarios_orig.describe(include="all")

In [25]:
# Atraque son las tuplas con fecha_salida no nulo
Atraque = itinerarios_orig[itinerarios_orig['fecha_salida'].notna()]
#len(Atraque)

In [26]:
# Itinerario son las tuplas con fecha_salida nulo
Itinerario = itinerarios_orig[itinerarios_orig['fecha_salida'].isna()]
del Itinerario["fecha_salida"]
#Itinerario

In [27]:
# Quitamos id_buque de tabla personal
Personal = personal_orig
del Personal["id_buque"]

In [30]:
Buque.to_csv('../tablas/Buque.csv', index=False)
Naviera.to_csv('../tablas/Naviera.csv', index=False)
BuquePesquero.to_csv('../tablas/BuquePesquero.csv', index=False)
BuqueCarga.to_csv('../tablas/BuqueCarga.csv', index=False)
BuquePetrolero.to_csv('../tablas/BuquePetrolero.csv', index=False)
Personal.to_csv('../tablas/Personal.csv', index=False)
Tiene.to_csv('../tablas/Tiene.csv', index=False)
Trabajan.to_csv('../tablas/Trabajan.csv', index=False)
Atraque.to_csv('../tablas/Atraque.csv', index=False)
Itinerario.to_csv('../tablas/Itinerario.csv', index=False)

In [39]:
len(Itinerario)

300

In [38]:
Itinerario = Itinerario.drop_duplicates()

In [54]:
Atraque.describe(include="all")

              fecha_atraque         fecha_salida    id_buque nombre_puerto
count                   592                  592  592.000000           592
unique                  592                  592         NaN            44
top     2014-01-19 20:53:45  2011-03-25 03:52:27         NaN      Quintero
freq                      1                    1         NaN            32
mean                    NaN                  NaN  126.385135           NaN
std                     NaN                  NaN   72.695878           NaN
min                     NaN                  NaN    0.000000           NaN
25%                     NaN                  NaN   66.000000           NaN
50%                     NaN                  NaN  128.000000           NaN
75%                     NaN                  NaN  189.000000           NaN
max                     NaN                  NaN  249.000000           NaN

In [44]:
Itinerario = Itinerario.astype({"id_buque": str})

In [45]:
Itinerario.describe(include="all")

              fecha_atraque id_buque nombre_puerto
count                   300      300           300
unique                  300      168            43
top     2021-05-05 00:39:03      174    Mejillones
freq                      1        5            15

In [48]:
IdBuquePatente.describe(include="all")

          id_buque patente
count   250.000000     250
unique         NaN     250
top            NaN  MZ9845
freq           NaN       1
mean    124.500000     NaN
std      72.312977     NaN
min       0.000000     NaN
25%      62.250000     NaN
50%     124.500000     NaN
75%     186.750000     NaN
max     249.000000     NaN

In [51]:
IdBuquePatente = IdBuquePatente.astype({"id_buque": str})
IdBuquePatente.describe(include="all")

       id_buque patente
count       250     250
unique      250     250
top         138  MZ9845
freq          1       1

In [53]:
Buque

     id_buque        pais
0           0       India
1           1      Canada
2           2    Singapur
3           3  Costa Rica
4           4   Argentina
..        ...         ...
245       245   Finlandia
246       246       Chile
247       247      Panama
248       248      Mexico
249       249       Chile

[250 rows x 2 columns]